Tekla Open API Reference for Tekla Structures 2025
ReinforcementCatalog Constructor
Overload List
Name | Description
ReinforcementCatalog()
 Initiates a new instance of the control.
ReinforcementCatalog(String, String, Double)
 Creates a new instance of the ReinforcementCatalog and will select in the tree the rebar that contains the given parameters (if possible).
Top
See Also
Reference
ReinforcementCatalog Class
Tekla.Structures.Dialog.UIControls Namespace